sdaiGetAggrByIterator(Sdai_ItrId*,SdaiPrimitiveType,System.Void*)
\details
Retrueves the value of current iterator element.
\param iterator [in] Iterator to get value from.
\param valueType [in] The desired type of the value to get.
\param value [out] A pointer to the place in memory to set the value.